equipepucpr/xmc_loader/firmware/XMC1x_ASC2SWD/Libraries/XMCLib/inc/xmc_usic.h
/*
 * Copyright (C) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use with
 * Infineon's microcontrollers.
 * This file can be freely distributed within development tools that are
 * supporting such microcontrollers.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 */

/**
 * @file xmc_usic.h
 * @date 20 Feb, 2015
 * @version 1.0.2
 *
 *
 * History <br>
 *
 * Version 1.0.0 Initial <br>
 * Version 1.0.2 Documentation improved <br>
 */

#ifndef XMC_USIC_H
#define XMC_USIC_H
/*******************************************************************************
 * HEADER FILES
 *******************************************************************************/

#include "xmc_common.h"

/**
 * @addtogroup XMClib XMC Peripheral Library
 * @{
 */

/**
 * @addtogroup USIC
 * @brief Universal Serial Interface Channel(USIC) driver for serial communication.
 *
 * The Universal Serial Interface Channel(USIC) module is a flexible interface module
 * covering several serial communication protocols. A USIC module contains two
 * independent communication channels named USICx_CH0 and USICx_CH1, with x
 * being the number of the USIC module. The user can program, during run-time, which protocol will be handled
 * by each communication channel and which pins are used.
 * The driver provides APIs, configuration structures and enumerations to configure common features of multiple serial communication protocols.
 * 
 * USIC driver features:
 * -# Allows configuration of FIFO for transmit and receive functions.
 * -# Provides a structure type XMC_USIC_CH_t to represent the USIC channel registers in a programmer
 friendly format.
 * -# Allows configuration of automatic update for frame length, word length, slave select or slave address.
 * -# Allows transmission of data to FIFO using XMC_USIC_CH_TXFIFO_PutData() and XMC_USIC_CH_TXFIFO_PutDataFLEMode()
 * -# Allows reading of received data in FIFO using XMC_USIC_CH_RXFIFO_GetData()
 * -# Allows configuration of baudrate using XMC_USIC_CH_SetBaudrate()
 * -# Provides API to trigger interrupts using XMC_USIC_CH_TriggerServiceRequest()
 * @{
 */

/*******************************************************************************
 * MACROS
 *******************************************************************************/

#define XMC_USIC0 (XMC_USIC_t *)USIC0_BASE				/**< USIC0 module base address */
#define XMC_USIC0_CH0 (XMC_USIC_CH_t *)USIC0_CH0_BASE	/**< USIC0 channel 0 base address */
#define XMC_USIC0_CH1 (XMC_USIC_CH_t *)USIC0_CH1_BASE	/**< USIC0 channel 1 base address */

#if defined(USIC1)
#define XMC_USIC1 (XMC_USIC_t *)USIC1_BASE				/**< USIC1 module base address */
#define XMC_USIC1_CH0 (XMC_USIC_CH_t *)USIC1_CH0_BASE	/**< USIC1 channel 0 base address */
#define XMC_USIC1_CH1 (XMC_USIC_CH_t *)USIC1_CH1_BASE	/**< USIC1 channel 1 base address */
#endif

#if defined(USIC2)
#define XMC_USIC2 (XMC_USIC_t *)USIC2_BASE				/**< USIC2 module base address */
#define XMC_USIC2_CH0 (XMC_USIC_CH_t *)USIC2_CH0_BASE	/**< USIC2 channel 0 base address */
#define XMC_USIC2_CH1 (XMC_USIC_CH_t *)USIC2_CH1_BASE	/**< USIC2 channel 1 base address */
#endif

#if defined(USIC2)
/**
 * Macro checks if the channel is available. It returns \a true if the channel is available
 * and returns \a false if the channel is not available.
 */
#define XMC_USIC_CHECK_CH(channel) ((channel == XMC_USIC0_CH0) || \
                                     (channel == XMC_USIC0_CH1) || \
                                     (channel == XMC_USIC1_CH0) || \
                                     (channel == XMC_USIC1_CH1) || \
                                     (channel == XMC_USIC2_CH0) || \
                                     (channel == XMC_USIC2_CH1) )
#elif defined(USIC1)
/**
 * Macro checks if the channel is available. It returns \a true if the channel is available
 * and returns \a false if the channel is not available.
 */
#define XMC_USIC_CHECK_CH(channel) ((channel == XMC_USIC0_CH0) || \
                                     (channel == XMC_USIC0_CH1) || \
                                     (channel == XMC_USIC1_CH0) || \
                                     (channel == XMC_USIC1_CH1) )
#else
/**
 * Macro checks if the channel is available. It returns \a true if the channel is available
 * and returns \a false if the channel is not available.
 */
#define XMC_USIC_CHECK_CH(channel) ((channel == XMC_USIC0_CH0) || \
                                     (channel == XMC_USIC0_CH1) )
#endif

#define XMC_USIC_MAJOR_VERSION (1U) /**< Version number : Major version */
#define XMC_USIC_MINOR_VERSION (0U) /**< Version number : Minor version */
#define XMC_USIC_PATCH_VERSION (2U) /**< Version number : Patch version */

#define USIC_CH_DXCR_DSEL_Msk  USIC_CH_DX0CR_DSEL_Msk   /**< Common mask for DSEL bitfield mask in DXnCR register */
#define USIC_CH_DXCR_DSEL_Pos  USIC_CH_DX0CR_DSEL_Pos   /**< Common mask for DSEL bitfield position in DXnCR register */
#define USIC_CH_DXCR_SFSEL_Pos USIC_CH_DX0CR_SFSEL_Pos  /**< Common mask for SFSEL bitfield position in DXnCR register */
#define USIC_CH_DXCR_SFSEL_Msk USIC_CH_DX0CR_SFSEL_Msk  /**< Common mask for SFSEL bitfield mask in DXnCR register */
#define USIC_CH_DXCR_DPOL_Msk  USIC_CH_DX0CR_DPOL_Msk   /**< Common mask for DPOL bitfield mask in DXnCR register */
#define USIC_CH_DXCR_DFEN_Msk  USIC_CH_DX0CR_DFEN_Msk   /**< Common mask for DFEN bitfield mask in DXnCR register */
#define USIC_CH_DXCR_DSEN_Msk  USIC_CH_DX0CR_DSEN_Msk   /**< Common mask for DSEN bitfield mask in DXnCR register */


#if UC_FAMILY == XMC1
 #include "xmc1_usic_map.h"
#endif

#if UC_FAMILY == XMC4
 #include "xmc4_usic_map.h"
#endif

